-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Авг 18 2017 г., 00:17
-- Версия сервера: 5.5.25
-- Версия PHP: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `bitcoin`
--

-- --------------------------------------------------------

--
-- Структура таблицы `history`
--

CREATE TABLE IF NOT EXISTS `history` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id записи',
  `uid` int(11) NOT NULL COMMENT 'id пользователя',
  `action` text NOT NULL COMMENT 'Действие',
  `date` text NOT NULL COMMENT 'Дата/время',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='История операций сайта' AUTO_INCREMENT=36 ;

--
-- Дамп данных таблицы `history`
--

INSERT INTO `history` (`id`, `uid`, `action`, `date`) VALUES
(3, 50, 'Регистрация на сайте', '7 августа 2017 г., 14:39:21'),
(7, 52, 'Регистрация на сайте', '7 августа 2017 г., 14:47:18'),
(8, 52, 'Активация стартового стола', '7 августа 2017 г., 14:47:42'),
(9, 52, 'Изменение информации об аккаунте', '7 августа 2017 г., 15:20:09'),
(11, 52, 'Изменение информации об аккаунте', '7 августа 2017 г., 15:20:09'),
(12, 52, 'Изменение информации об аккаунте', '7 августа 2017 г., 15:20:09'),
(13, 50, 'Регистрация на сайте', '7 августа 2017 г., 14:39:21'),
(14, 52, 'Регистрация на сайте', '7 августа 2017 г., 14:47:18'),
(16, 52, 'Регистрация на сайте', '7 августа 2017 г., 14:47:18'),
(17, 52, 'Регистрация на сайте', '7 августа 2017 г., 14:47:18'),
(18, 52, 'Регистрация на сайте', '7 августа 2017 г., 14:47:18'),
(19, 52, 'Изменение информации об аккаунте', '7 августа 2017 г., 15:20:09'),
(20, 1, 'Подтверждён запрос на снятие $. Списано $1107 с аккаунта vlad2017', '7 августа 2017 г., 19:50:25'),
(21, 1, 'Подтверждён запрос на снятие $. Списано $100 с аккаунта alex1508', '7 августа 2017 г., 19:53:51'),
(22, 18, 'Изменение информации об аккаунте', '12 августа 2017 г., 1:24:44'),
(23, 1, 'Подтверждён запрос на ввод $. На аккаунт alex1508 начислено $123', '16 августа 2017 г., 18:59:13'),
(24, 53, 'Регистрация на сайте', '16 августа 2017 г., 19:07:47'),
(25, 54, 'Регистрация на сайте', '16 августа 2017 г., 20:32:55'),
(26, 55, 'Регистрация на сайте', '16 августа 2017 г., 20:34:38'),
(27, 56, 'Регистрация на сайте', '16 августа 2017 г., 20:35:41'),
(28, 57, 'Регистрация на сайте', '16 августа 2017 г., 20:37:26'),
(29, 58, 'Регистрация на сайте', '16 августа 2017 г., 22:03:51'),
(30, 1, 'Подтверждён запрос на ввод $. На аккаунт buka1508 начислено $123', '16 августа 2017 г., 22:05:19'),
(31, 58, 'Активация стартового стола', '16 августа 2017 г., 22:05:42'),
(32, 59, 'Регистрация на сайте', '17 августа 2017 г., 0:25:11'),
(33, 59, 'Активация стартового стола', '17 августа 2017 г., 0:25:58'),
(34, 59, 'Регистрация на сайте', '17 августа 2017 г., 22:49:31'),
(35, 18, 'Изменение пароля', '17 августа 2017 г., 22:57:47');

-- --------------------------------------------------------

--
-- Структура таблицы `input_money`
--

CREATE TABLE IF NOT EXISTS `input_money` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id записи',
  `uid` int(11) NOT NULL COMMENT 'id пользователя',
  `payment` text NOT NULL COMMENT 'Наименование платёжной системы',
  `card` text NOT NULL COMMENT 'Номер карты',
  `count` int(11) NOT NULL COMMENT 'Сумма, $',
  `time` text NOT NULL COMMENT 'Дата/время',
  `status` int(11) NOT NULL DEFAULT '0' COMMENT 'Статус заявки(1-подтверждён, 0-нет)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=4 ;

--
-- Дамп данных таблицы `input_money`
--

INSERT INTO `input_money` (`id`, `uid`, `payment`, `card`, `count`, `time`, `status`) VALUES
(1, 18, 'Perfect Money', 'U12342314223', 123, '16 августа 2017 г., 17:09:21', 1),
(2, 18, 'Qiwi Wallet', '+7447463347623', 123, '16 августа 2017 г., 17:14:58', 0),
(3, 58, 'Perfect Money', 'U234243224234', 123, '16 августа 2017 г., 22:04:55', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `output_money`
--

CREATE TABLE IF NOT EXISTS `output_money` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id записи',
  `uid` int(11) NOT NULL COMMENT 'id пользователя',
  `status` int(11) NOT NULL COMMENT '0-не подтверждён, 1-подтверждён',
  `count` int(11) NOT NULL COMMENT 'Сумма',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='Запросы на вывод $ с аккаунта' AUTO_INCREMENT=4 ;

--
-- Дамп данных таблицы `output_money`
--

INSERT INTO `output_money` (`id`, `uid`, `status`, `count`) VALUES
(1, 7, 1, 1107),
(2, 18, 1, 100),
(3, 7, 0, 3);

-- --------------------------------------------------------

--
-- Структура таблицы `tables`
--

CREATE TABLE IF NOT EXISTS `tables` (
  `id` int(11) NOT NULL COMMENT 'id пользователя',
  `start` int(11) NOT NULL,
  `main` int(11) NOT NULL,
  `leader` int(11) NOT NULL,
  `vip` int(11) NOT NULL,
  `1nd` int(11) NOT NULL,
  `2nd` int(11) NOT NULL,
  `count_leader` int(11) NOT NULL DEFAULT '0' COMMENT 'Кол-во завершенных лидерских столов',
  `count_vip` int(11) NOT NULL DEFAULT '0' COMMENT 'Кол-во завершенных вип столов'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Таблица, у кого какой стол открыт';

--
-- Дамп данных таблицы `tables`
--

INSERT INTO `tables` (`id`, `start`, `main`, `leader`, `vip`, `1nd`, `2nd`, `count_leader`, `count_vip`) VALUES
(8, 1, 0, 0, 0, 0, 0, 0, 0),
(16, 1, 0, 0, 0, 0, 0, 0, 0),
(17, 0, 1, 0, 0, 0, 0, 0, 0),
(18, 1, 0, 1, 0, 0, 0, 0, 0),
(7, 1, 0, 1, 0, 0, 0, 0, 0),
(20, 0, 1, 0, 0, 0, 0, 0, 0),
(21, 1, 0, 0, 0, 0, 0, 0, 0),
(22, 1, 0, 0, 0, 0, 0, 0, 0),
(23, 1, 0, 0, 0, 0, 0, 0, 0),
(24, 0, 1, 0, 0, 0, 0, 0, 0),
(25, 0, 1, 0, 0, 0, 0, 0, 0),
(26, 0, 1, 0, 0, 0, 0, 0, 0),
(27, 1, 0, 0, 0, 0, 0, 0, 0),
(28, 1, 0, 0, 0, 0, 0, 0, 0),
(30, 1, 0, 0, 0, 0, 0, 0, 0),
(31, 1, 0, 0, 0, 0, 0, 0, 0),
(32, 1, 0, 0, 0, 0, 0, 0, 0),
(33, 1, 0, 0, 0, 0, 0, 0, 0),
(34, 1, 0, 0, 0, 0, 0, 0, 0),
(35, 1, 0, 0, 0, 0, 0, 0, 0),
(36, 1, 0, 0, 0, 0, 0, 0, 0),
(37, 1, 0, 0, 0, 0, 0, 0, 0),
(38, 1, 0, 0, 0, 0, 0, 0, 0),
(39, 1, 0, 0, 0, 0, 0, 0, 0),
(40, 0, 0, 0, 0, 0, 0, 0, 0),
(41, 1, 0, 1, 0, 0, 0, 0, 0),
(42, 0, 0, 0, 0, 0, 0, 0, 0),
(53, 0, 0, 0, 0, 0, 0, 0, 0),
(54, 0, 0, 0, 0, 0, 0, 0, 0),
(55, 0, 0, 0, 0, 0, 0, 0, 0),
(56, 0, 0, 0, 0, 0, 0, 0, 0),
(57, 0, 0, 0, 0, 0, 0, 0, 0),
(58, 1, 0, 0, 0, 0, 0, 0, 0),
(2, 0, 0, 0, 0, 0, 0, 0, 0),
(59, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `tree`
--

CREATE TABLE IF NOT EXISTS `tree` (
  `parent` int(11) NOT NULL COMMENT 'id родителя',
  `child` int(11) NOT NULL COMMENT 'id ребёнка',
  `status` int(11) NOT NULL COMMENT 'Состояние связи. 0-неактивно, 1-активно',
  `block1` int(11) NOT NULL COMMENT 'Активность 1-ого блока(0-неактивен, 1-активен)',
  `block2` int(11) NOT NULL COMMENT 'Активность 2-ого блока',
  `block3` int(11) NOT NULL COMMENT 'Активность 3-ого блока'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Взаимосвязи всех участников';

--
-- Дамп данных таблицы `tree`
--

INSERT INTO `tree` (`parent`, `child`, `status`, `block1`, `block2`, `block3`) VALUES
(8, 16, 1, 1, 0, 0),
(7, 17, 1, 0, 0, 0),
(7, 18, 1, 0, 1, 0),
(7, 20, 1, 0, 0, 0),
(17, 21, 1, 1, 0, 0),
(17, 22, 1, 1, 0, 0),
(17, 23, 1, 1, 0, 0),
(18, 24, 1, 0, 0, 0),
(18, 25, 1, 0, 0, 0),
(18, 26, 1, 0, 0, 0),
(20, 27, 1, 1, 0, 0),
(20, 28, 1, 1, 0, 0),
(20, 30, 1, 1, 0, 0),
(24, 31, 1, 1, 0, 0),
(24, 32, 1, 1, 0, 0),
(24, 33, 1, 1, 0, 0),
(25, 34, 1, 1, 0, 0),
(25, 35, 1, 1, 0, 0),
(25, 36, 1, 1, 0, 0),
(26, 37, 1, 1, 0, 0),
(26, 38, 1, 1, 0, 0),
(26, 39, 1, 1, 0, 0),
(7, 41, 1, 0, 1, 0),
(53, 57, 0, 0, 0, 0),
(37, 58, 1, 1, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` text NOT NULL,
  `email` text NOT NULL,
  `password` text NOT NULL,
  `surname` text NOT NULL,
  `name` text NOT NULL,
  `patronymic` text NOT NULL,
  `skype` text NOT NULL,
  `advcash` text NOT NULL,
  `balance` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=60 ;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `email`, `password`, `surname`, `name`, `patronymic`, `skype`, `advcash`, `balance`) VALUES
(1, 'admin', 'admin@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'admin', 'admin', 'admin', '', '', 0),
(2, 'qwe', 'qwe@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'test', 'test', 'test', '', '', 0),
(3, '123', 'qwe@ya.ruq', 'e10adc3949ba59abbe56e057f20f883e', 'test', 'test', 'test', '', '', 0),
(4, 'novikov', 'mail@mail.ru', 'e10adc3949ba59abbe56e057f20f883e', 'Новиков', 'Степан', 'Дмитриевич', '', '', 0),
(6, 'qwertyuiopas2017', 'wq@ya.ru', 'e10adc3949ba59abbe56e057f20f883e', '1', '1', '1', '', '', 0),
(7, 'vlad2017', 'vlad@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Горяйнов', 'Владислав', 'Степанович', 'skype1306', 'U 2484  3845 3845', 123),
(8, 'Nickolas88', 'nick@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Уткин', 'Николай', 'Сергеевич', '', '', 0),
(16, 'bomber2017', 'shurik@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Шуриков', 'Станислав', 'Сергеевич', '', '', 17),
(17, 'ilya2017', 'ilya@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Чешков', 'Илья', 'Дмитриевич', '', '', 615),
(18, 'alex1508', 'alex@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Шипачев', 'Дмитрий', 'Алеексеевич', 'dima1508', '', 1015),
(20, 'dima1908', 'dima@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Покровский', 'Дмитрий', 'Григорьевич', '', '', 477),
(21, 'oleg2017', 'oleg@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Черный', 'Олег', 'Владиславович', '', '', 477),
(22, 'leksey1968', 'leshka@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Марей', 'Алексей', 'Тихонович', '', '', 0),
(23, 'laroma1302', 'roma@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Ларин', 'Роман', 'Алексеевич', '', '', 0),
(24, 'daronina2017', 'daronina@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Даронина', 'Зинаида', 'Викторовна', '', '', 0),
(25, 'victor2017', 'victor@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Воркутов', 'Виктор', 'Михайлович', '', '', 0),
(26, 'mihail2017', 'miha@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Харламов', 'Михаил', 'Сергеевич', '', '', 0),
(27, 'sergey1000', 'sergey@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Фролов', 'Сергей', 'Борисович', '', '', 0),
(28, 'boris2000', 'boris@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Черников', 'Борис', 'Николаевич', '', '', 0),
(30, 'ludmila', 'ludmila@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Бочкова', 'Людмила', 'Кантемировна', '', '', 0),
(31, 'arkada300', 'arkada@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Шумилин', 'Аркадий', 'Григорьевич', '', '', 0),
(32, 'feofan400', 'feafan@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Волков', 'Феофан', 'Митриевич', '', '', 0),
(33, 'pavel500', 'pavel@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Скачков', 'Павел', 'Андреевич', '', '', 0),
(34, 'evgen600', 'evgen@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Бабушин', 'Евгений', 'Петрович', '', '', 0),
(35, 'petr700', 'petr@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Зарьянов', 'Петр', 'Васильевич', '', '', 0),
(36, 'vasa800', 'vasily@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Хорошеев', 'Василий', 'Алибабаевич', '', '', 0),
(37, 'stas900', 'stanislav@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Шифров', 'Станислав', 'Дмитриевич', '', '', 0),
(38, 'nikita1000', 'nikita@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Озаров', 'Никита', 'Андреевич', '', '', 0),
(39, 'kostik1100', 'kostik@ya.ru', '25d55ad283aa400af464c76d713c07ad', 'Круглов', 'Константин', 'Викторович', '', '', 0),
(40, 'calipso1703', 'krisvoyc@gmail.com', '25d55ad283aa400af464c76d713c07ad', 'Войцева', 'Кристина', 'Сергеевна', 'calipso1703', 'U 3432 3242 2342', 0);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
